tutorials/Myna/template/system/controlDict
/*---------------------------------------------------------------------------
     AdditiveFOAM template input file (compatible with 1.0, OpenFOAM 10)

                      Created for simulation with Myna
  ---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     additiveFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2.75;

deltaT          1e-7;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           1.0;

maxDi           100;

maxAlphaCo      1.0;

functions
{
    #includeFunc    ExaCA
}
// ************************************************************************* //
