tutorials/Myna/template/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3750;
        startFace       162375;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3750;
        startFace       166125;
    }
    sides
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5250;
        startFace       169875;
    }
)

// ************************************************************************* //
