tutorials/Myna/template/constant/heatSourceDict
/*---------------------------------------------------------------------------
     AdditiveFOAM template input file (compatible with 1.0, OpenFOAM 10)

                      Created for simulation with Myna
  ---------------------------------------------------------------------------*/

FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          heatSourceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources         ( beam );

beam
{
    pathName        scanpath.txt;
    absorptionModel Kelly;
    KellyCoeffs
    {
        geometry        cylinder;
        eta0            0.36;
        etaMin          0.5;
    }
    heatSourceModel projectedGaussian;
    projectedGaussianCoeffs
    {
        dimensions      ( 6.25e-05 6.25e-05 3.0e-05 );
        A               2.73;
        B               3.06;
        transient       true;
        isoValue        1709;
        nPoints         (10 10 10);
    }
}


// ************************************************************************* //
