tutorials/Myna/template/constant/scanpath.txt
Mode	X(m)	Y(m)	Z(m)	Power(W)	tParam
1	0.051212	-0.055389	0.000000	0	0.0
0	0.051325	-0.055365	0.000000	350	0.802
0	0.052366	-0.055097	0.000000	0	0.723
0	0.050141	-0.055490	0.000000	350	0.833
0	0.049712	-0.055484	0.000000	0	0.11
0	0.052812	-0.054936	0.000000	350	0.835
0	0.053122	-0.054800	0.000000	0	0.069
0	0.049343	-0.055466	0.000000	350	0.833
0	0.049052	-0.055436	0.000000	0	0.051
0	0.053383	-0.054669	0.000000	350	0.833
0	0.053621	-0.054544	0.000000	0	0.042
0	0.048796	-0.055395	0.000000	350	0.833
0	0.048558	-0.055353	0.000000	0	0.034
0	0.053836	-0.054425	0.000000	350	0.833
0	0.054032	-0.054306	0.000000	0	0.03
0	0.048344	-0.055311	0.000000	350	0.833
0	0.048124	-0.055264	0.000000	0	0.028
0	0.054210	-0.054193	0.000000	350	0.833
0	0.054353	-0.054086	0.000000	0	0.021
0	0.047951	-0.055210	0.000000	350	0.833
0	0.047755	-0.055162	0.000000	0	0.023
0	0.054514	-0.053972	0.000000	350	0.834
0	0.054639	-0.053865	0.000000	0	0.018
0	0.047606	-0.055109	0.000000	350	0.834
0	0.047439	-0.055055	0.000000	0	0.018
0	0.054782	-0.053758	0.000000	350	0.833
0	0.054901	-0.053651	0.000000	0	0.016
0	0.047303	-0.054996	0.000000	350	0.833
0	0.047130	-0.054942	0.000000	0	0.017
0	0.055032	-0.053550	0.000000	350	0.834
0	0.055127	-0.053449	0.000000	0	0.013
0	0.046981	-0.054883	0.000000	350	0.832
0	0.046874	-0.054817	0.000000	0	0.011
0	0.055234	-0.053348	0.000000	350	0.832
0	0.055347	-0.053241	0.000000	0	0.014
0	0.046737	-0.054758	0.000000	350	0.834
0	0.046618	-0.054698	0.000000	0	0.011
0	0.055430	-0.053145	0.000000	350	0.832
0	0.055531	-0.053044	0.000000	0	0.012
0	0.046493	-0.054639	0.000000	350	0.833
0	0.046380	-0.054573	0.000000	0	0.011
0	0.055615	-0.052943	0.000000	350	0.833
0	0.055698	-0.052848	0.000000	0	0.01
0	0.046273	-0.054508	0.000000	350	0.832
0	0.046160	-0.054448	0.000000	0	0.01
0	0.055769	-0.052753	0.000000	350	0.833
0	0.055853	-0.052652	0.000000	0	0.01
0	0.046047	-0.054383	0.000000	350	0.833
0	0.045946	-0.054318	0.000000	0	0.009
0	0.055924	-0.052556	0.000000	350	0.833
0	0.056001	-0.052461	0.000000	0	0.009
0	0.045845	-0.054252	0.000000	350	0.833
0	0.045732	-0.054187	0.000000	0	0.01
0	0.056073	-0.052366	0.000000	350	0.833
0	0.056138	-0.052271	0.000000	0	0.008
0	0.045642	-0.054121	0.000000	350	0.833
0	0.045547	-0.054056	0.000000	0	0.008
0	0.056216	-0.052176	0.000000	350	0.833
0	0.056269	-0.052080	0.000000	0	0.008
0	0.045464	-0.053984	0.000000	350	0.833
0	0.045363	-0.053919	0.000000	0	0.008
0	0.056335	-0.051985	0.000000	350	0.833
0	0.056388	-0.051890	0.000000	0	0.008
0	0.045291	-0.053847	0.000000	350	0.832
0	0.045208	-0.053782	0.000000	0	0.007
0	0.056454	-0.051801	0.000000	350	0.833
0	0.056495	-0.051706	0.000000	0	0.007
0	0.045119	-0.053717	0.000000	350	0.833
0	0.045047	-0.053645	0.000000	0	0.007
0	0.056543	-0.051616	0.000000	350	0.833
0	0.056602	-0.051521	0.000000	0	0.007
0	0.044970	-0.053574	0.000000	350	0.833
0	0.044875	-0.053508	0.000000	0	0.008
0	0.056644	-0.051432	0.000000	350	0.833
0	0.056698	-0.051337	0.000000	0	0.007
0	0.044815	-0.053437	0.000000	350	0.832
0	0.044732	-0.053366	0.000000	0	0.007
0	0.056727	-0.051253	0.000000	350	0.833
0	0.056781	-0.051158	0.000000	0	0.007
0	0.044673	-0.053294	0.000000	350	0.833
0	0.044589	-0.053223	0.000000	0	0.007
0	0.056811	-0.051069	0.000000	350	0.833
0	0.056876	-0.050974	0.000000	0	0.007
0	0.044530	-0.053151	0.000000	350	0.833
0	0.044452	-0.053080	0.000000	0	0.007
0	0.056900	-0.050890	0.000000	350	0.833
0	0.056941	-0.050795	0.000000	0	0.006
0	0.044405	-0.053009	0.000000	350	0.833
0	0.044316	-0.052937	0.000000	0	0.007
0	0.056977	-0.050706	0.000000	350	0.833
0	0.057001	-0.050617	0.000000	0	0.006
0	0.044274	-0.052866	0.000000	350	0.832
0	0.044203	-0.052794	0.000000	0	0.006
0	0.057037	-0.050527	0.000000	350	0.833
0	0.057072	-0.050438	0.000000	0	0.006
0	0.044161	-0.052717	0.000000	350	0.833
0	0.044078	-0.052652	0.000000	0	0.006
0	0.057090	-0.050355	0.000000	350	0.833
0	0.057126	-0.050266	0.000000	0	0.006
0	0.044036	-0.052574	0.000000	350	0.833
...
0	0.053187	-0.041222	0.000000	350	0.834
