tutorials/Myna/template/constant/thermoPath
(
1471.0000 1.0000
1709.0000 0.0000
)
