tutorials/Myna/template/0/U
/*---------------------------------------------------------------------------
     AdditiveFOAM template input file (compatible with 1.0, OpenFOAM 10)

                      Created for simulation with Myna
  ---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    part
    {
        type            marangoni;
        dSigmadT        -0.24e-3;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
