tutorials/Myna/template/system/ExaCA
/*---------------------------------------------------------------------------
     AdditiveFOAM template input file (compatible with 1.0, OpenFOAM 10)

                      Created for simulation with Myna
  ---------------------------------------------------------------------------*/

ExaCA
{
    type ExaCA;
    libs ("libExaCAFunctionObject.so");
    
    box         ( 0.0495 -0.0495 -0.0003 ) ( 0.0505 -0.0485 0 );
    dx          2.5e-6;
    isoValue    1709;
}

// ************************************************************************* //
