tutorials/Myna/template/system/decomposeParDict
/*---------------------------------------------------------------------------
     AdditiveFOAM template input file (compatible with 1.0, OpenFOAM 10)

                      Created for simulation with Myna
  ---------------------------------------------------------------------------*/

FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 8;

method          scotch;


// ************************************************************************* //
